tutorials/extraTurbulenceModels/kkLOmega/alpha4/consistentSimpleFoam/0.org/kt
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      kt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kt;

boundaryField
{
	"(top|bottom)"
    {
        type            fixedValue;
        value           uniform 0;
    }

    farfield
    {
        type           inletOutlet;
        inletValue     uniform $kt;
    }

    frontback
    {
        type           empty;
    }
}


// ************************************************************************* //
