tutorials/extraTurbulenceModels/kkLOmega/alpha4/consistentSimpleFoam/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omega;

boundaryField
{
    "(top|bottom)"
    {
        type            zeroGradient;
    }

    farfield
    {
        type            inletOutlet;
        inletValue      uniform $omega;
    }

    frontback
    {
        type            empty;
    }
}


// ************************************************************************* //
